app/Services/ClassService.php

    public function get()
    {
        return DB::table('academic_class as ac')
        ->select('ac.*','ab.branch_name')
        ->leftJoin('academic_branch as ab','ab.id_branch','ac.branch_id')
        ->where('ac.status_id',1);
---
select `ac`.*, `ab`.`branch_name` from `academic_class` as `ac` left join `academic_branch` as `ab` on `ab`.`id_branch` = `ac`.`branch_id` where `ac`.`status_id` = 1