app/Services/ClassSetupService.php

insert into `academic_class_settings` (`class_id`, `branch_id`, `section_id`, `status_id`) values ('2', '2', '1', 1)
---
    public function add($data,$section){
       return DB::table('academic_class_settings')->insert([
            'class_id'=>$data['class_id'],
            'branch_id'=>$data['branch_id'],
            'section_id'=> $section,
            'status_id'=> 1,
        ]);

select acs.branch_id, br.branch_name, acs.class_id, ac.class_name, GROUP_CONCAT(DISTINCT acs.section_id ORDER BY acs.section_id SEPARATOR ",") as section_id from `academic_class_settings` as `acs` left join `academic_branch` as `br` on `acs`.`branch_id` = `br`.`id_branch` left join `academic_class` as `ac` on `acs`.`class_id` = `ac`.`id_class` where `acs`.`status_id` = 1 and `acs`.`class_id` = '1' and `acs`.`branch_id` = '1' group by `acs`.`class_id`, `acs`.`branch_id`, `br`.`branch_name`, `ac`.`class_name` limit 1
---
    public function edit($branch_id,$id)
    {

      return DB::table('academic_class_settings as acs')
      ->select(
          DB::raw('acs.branch_id'),
          DB::raw('br.branch_name'),
          DB::raw('acs.class_id'),
          DB::raw('ac.class_name'),

          DB::raw('GROUP_CONCAT(DISTINCT acs.section_id ORDER BY acs.section_id SEPARATOR ",") as section_id')
      )
      ->leftJoin('academic_branch as br','acs.branch_id','br.id_branch')
      ->leftJoin('academic_class as ac','acs.class_id','ac.id_class')
      ->where('acs.status_id', 1)
      ->where('acs.class_id', $id)
      ->where('acs.branch_id', $branch_id)
      ->groupBy('acs.class_id','acs.branch_id','br.branch_name','ac.class_name')
      ->first();