app/Services/SectionService.php

    public function get()
    {
        return  DB::table('academic_section as sec')
        ->select('sec.*','ab.branch_name')
        ->leftJoin('academic_branch as ab','ab.id_branch','sec.branch_id')
        ->where('sec.status_id',1);
---
select `sec`.*, `ab`.`branch_name` from `academic_section` as `sec` left join `academic_branch` as `ab` on `ab`.`id_branch` = `sec`.`branch_id` where `sec`.`status_id` = 1

    public function update($data, $id){
        DB::table('academic_section')->where('id_section', $id)->update([
            'section_name'=>$data['section_name'],
            'branch_id'=>$data['branch_id'],
        ]);
---
update `academic_section` set `section_name` = 'Section-B', `branch_id` = '1' where `id_section` = '2'