app/Services/ShiftService.php

select `shift`.*, `ab`.`branch_name` from `academic_shift` as `shift` left join `academic_branch` as `ab` on `ab`.`id_branch` = `shift`.`branch_id` where `shift`.`status_id` = 1
---
    public function get()
    {
        return  DB::table('academic_shift as shift')
        ->select('shift.*','ab.branch_name')
        ->leftJoin('academic_branch as ab','ab.id_branch','shift.branch_id')
        ->where('shift.status_id',1);

update `academic_shift` set `shift_name` = 'Evening', `shift_start` = '14:00:00', `shift_end` = '16:00:00', `branch_id` = '2' where `id_shift` = '2'
---
    public function update($data, $id){
        DB::table('academic_shift')->where('id_shift', $id)->update([
            'shift_name'=>$data['shift_name'],
            'shift_start'=>$data['shift_start'],
            'shift_end'=>$data['shift_end'],
            'branch_id'=>$data['branch_id'],
        ]);