app/Services/StudentService.php

    public function add($data){
        return DB::table('student_info')->insertGetId([
            'student_name'=>$data['student_name'],
            'mobile'=>$data['father_mobile'],
            'email'=>$data['email'],
            'dob'=>$data['dob'],
            'father_name'=>$data['father_name'],
            'mother_name'=>$data['mother_name'],
            'father_mobile'=>$data['father_mobile'],
            'mother_mobile'=>$data['mother_mobile'],
            'father_email'=>$data['father_email'],
            'mother_email'=>$data['mother_email'],
            'present_address'=>$data['present_address'],
            'permanent_address'=>$data['permanent_address'],
            'status_id'=> 1,
        ]);
---
insert into `student_info` (`student_name`, `mobile`, `email`, `dob`, `father_name`, `mother_name`, `father_mobile`, `mother_mobile`, `father_email`, `mother_email`, `present_address`, `permanent_address`, `status_id`) values ('Melissa Mendez', '81', 'jixefete@mailinator.com', '1970-11-05', 'Mira Phelps', 'Tanek Stevenson', '81', '12', 'lymarotini@mailinator.com', 'pufac@mailinator.com', 'Aliqua Ut nulla per', 'Vel magni labore cup', 1)

    public function classAssignment($data,$id){
        return DB::table('student_class_assignment')->insert([
            'student_id'=>$id,
            'branch_id'=>$data['branch_id'],
            'class_id'=>$data['class_id'],
            'section_id'=>$data['section_id'],
            'shift_id'=>$data['shift_id'],
            'status_id'=> 1,
        ]);
---
insert into `student_class_assignment` (`student_id`, `branch_id`, `class_id`, `section_id`, `shift_id`, `status_id`) values (8, '1', '2', '1', '1', 1)

    public function getSection($branch_id,$class_id)
    {

        $sections = DB::table('academic_class_settings as acs')
            ->select('sec.section_name','acs.section_id')
            ->leftJoin('academic_section as sec','acs.section_id','sec.id_section')
            ->where('acs.status_id', 1)
            ->where('acs.class_id', $class_id)
            ->where('acs.branch_id', $branch_id)
            ->get();
---
select `sec`.`section_name`, `acs`.`section_id` from `academic_class_settings` as `acs` left join `academic_section` as `sec` on `acs`.`section_id` = `sec`.`id_section` where `acs`.`status_id` = 1 and `acs`.`class_id` = '2' and `acs`.`branch_id` = '1'