app/Services/SubjectAssignService.php

    public function add($data, $subject)
    {
        DB::table('academic_subject_assign')->insert([
            'class_id' => $data['class_id'],
            'branch_id' => $data['branch_id'],
            'subject_id' => $subject,
            'status_id' => 1,
        ]);
---
insert into `academic_subject_assign` (`class_id`, `branch_id`, `subject_id`, `status_id`) values ('1', '1', '1', 1)

    public function edit($branch_id,$id)
    {

      return DB::table('academic_subject_assign as asa')
      ->select(
          DB::raw('asa.branch_id'),
          DB::raw('br.branch_name'),
          DB::raw('asa.class_id'),
          DB::raw('ac.class_name'),
          DB::raw('GROUP_CONCAT(DISTINCT asa.subject_id ORDER BY asa.subject_id SEPARATOR ",") as subject_id')
      )
      ->leftJoin('academic_branch as br','asa.branch_id','br.id_branch')
      ->leftJoin('academic_class as ac','asa.class_id','ac.id_class')
      ->where('asa.status_id', 1)
      ->where('asa.class_id', $id)
      ->where('asa.branch_id', $branch_id)
      ->groupBy('asa.class_id','asa.branch_id','br.branch_name','ac.class_name')
      ->first();
---
select asa.branch_id, br.branch_name, asa.class_id, ac.class_name, GROUP_CONCAT(DISTINCT asa.subject_id ORDER BY asa.subject_id SEPARATOR ",") as subject_id from `academic_subject_assign` as `asa` left join `academic_branch` as `br` on `asa`.`branch_id` = `br`.`id_branch` left join `academic_class` as `ac` on `asa`.`class_id` = `ac`.`id_class` where `asa`.`status_id` = 1 and `asa`.`class_id` = '1' and `asa`.`branch_id` = '1' group by `asa`.`class_id`, `asa`.`branch_id`, `br`.`branch_name`, `ac`.`class_name` limit 1

    public function update($branch_id,$class_id)
    {
        return DB::table('academic_subject_assign')->where('branch_id',$branch_id)->where('class_id',$class_id)->update([
            'status_id'=> 0,
        ]);
---
update `academic_subject_assign` set `status_id` = 0 where `branch_id` = '1' and `class_id` = '1'