app/Services/SubjectService.php

select `sub`.*, `ab`.`branch_name` from `academic_subject` as `sub` left join `academic_branch` as `ab` on `ab`.`id_branch` = `sub`.`branch_id` where `sub`.`status_id` = 1
---
    public function get()
    {
        return  DB::table('academic_subject as sub')
        ->select('sub.*','ab.branch_name')
        ->leftJoin('academic_branch as ab','ab.id_branch','sub.branch_id')
        ->where('sub.status_id',1);

update `academic_subject` set `subject_name` = 'English', `branch_id` = '2' where `id_subject` = '2'
---
    public function update($data, $id){
        DB::table('academic_subject')->where('id_subject', $id)->update([
            'subject_name'=>$data['subject_name'],
            'branch_id'=>$data['branch_id'],
        ]);