app/Providers/AppServiceProvider.php

select * from `acl_modules` where `parent_id` = '0' and `status_id` = 1 order by `sort` asc
select * from `acl_modules` where `parent_id` != 0 and `status_id` = 1 order by `sort` asc
select * from `acl_module_users` where `status_id` = 1 and `user_id` = 1
---
    public function boot()
    {
        Paginator::useBootstrap();

        View::composer('*', function ($view) {
            if (Auth::user()) {
                $login_role_id = Auth::user()->role_id;
                $user_id = Auth::user()->id;

                $menus = DB::table('acl_modules')->where('parent_id', '0')->where('status_id', 1)->orderBy('sort', 'ASC')->get();
                $submenus = DB::table('acl_modules')->where('parent_id', '!=', 0)->where('status_id', 1)->orderBy('sort', 'ASC')->get();

                $roleModules = DB::table('acl_module_users')->where('status_id', 1)->where('user_id', $user_id)->get();