app/Http/Controllers/Admin/SectionController.php

select * from `academic_section` where `id_section` = '2' and `status_id` = 1 limit 1
---
    public function edit()
    {
       $id = $_GET['id'];
       return DB::table('academic_section')->where('id_section', $id)->where('status_id', 1)->first();