app/Http/Controllers/Admin/ShiftController.php

select * from `academic_shift` where `id_shift` = '2' and `status_id` = 1 limit 1
---
    public function edit()
    {
       $id = $_GET['id'];
       return DB::table('academic_shift')->where('id_shift', $id)->where('status_id', 1)->first();