app/Http/Controllers/Admin/StudentController.php

    public function store(Request $request)
    {

        $validated = $request->validate([
            'student_name' => 'required|max:128',
            'mobile' => "required|numeric|min:11|unique:student_info",
            'dob' => 'required',
        ]);

       // try {
            $data = $request->all();
            $id = $this->StudentService->add($data);

            if($id){
                // save student_class_assignment
                $class_assignment = $this->StudentService->classAssignment($data,$id);
                // save image

                if (!empty($img = $request->file('img'))) {
                    $name = $img->getClientOriginalName();
                    $ext = pathinfo($name, PATHINFO_EXTENSION);
                    $fileName = 'img-' . rand(1111111, 9999999) . '.' . $ext;
                    $folder = "student/";
                    $path = $folder . $fileName;
                    $img->move(public_path($folder), $fileName);
                    DB::table("student_info")->where("id_student", $id)->update(['img' => $path]);
---
update `student_info` set `img` = 'student/img-4039940.png' where `id_student` = 8