app/Http/Controllers/Admin/SubjectController.php

    public function edit()
    {
       $id = $_GET['id'];
       return DB::table('academic_subject')->where('id_subject', $id)->where('status_id', 1)->first();
---
select * from `academic_subject` where `id_subject` = '2' and `status_id` = 1 limit 1